pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxSdmmc_bf.h
/** \brief Offset for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD_TOUT_ERR */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD_TOUT_ERR_OFF (1u)

/** \brief Length for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD_CRC_ERR */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD_CRC_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD_CRC_ERR */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD_CRC_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD_CRC_ERR */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD_CRC_ERR_OFF (2u)

/** \brief Length for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD_EBIT_ERR */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD_EBIT_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD_EBIT_ERR */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD_EBIT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD_EBIT_ERR */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD_EBIT_ERR_OFF (3u)

/** \brief Length for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD_IDX_ERR */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD_IDX_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD_IDX_ERR */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD_IDX_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD_IDX_ERR */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD_IDX_ERR_OFF (4u)

/** \brief Length for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD_RESP_ERR */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD_RESP_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD_RESP_ERR */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD_RESP_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_AUTO_CMD_RESP_ERR */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_AUTO_CMD_RESP_ERR_OFF (5u)

/** \brief Length for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_CMD_NOT_ISSUED_AUTO_CMD12 */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_CMD_NOT_ISSUED_AUTO_CMD12_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_CMD_NOT_ISSUED_AUTO_CMD12 */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_CMD_NOT_ISSUED_AUTO_CMD12_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits.FORCE_CMD_NOT_ISSUED_AUTO_CMD12 */
#define IFX_SDMMC_FORCE_AUTO_CMD_STAT_FORCE_CMD_NOT_ISSUED_AUTO_CMD12_OFF (7u)

/** \brief Length for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_CMD_TOUT_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_CMD_TOUT_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_CMD_TOUT_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_CMD_TOUT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_CMD_TOUT_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_CMD_TOUT_ERR_OFF (0u)

/** \brief Length for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_CMD_CRC_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_CMD_CRC_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_CMD_CRC_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_CMD_CRC_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_CMD_CRC_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_CMD_CRC_ERR_OFF (1u)

/** \brief Length for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_CMD_END_BIT_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_CMD_END_BIT_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_CMD_END_BIT_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_CMD_END_BIT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_CMD_END_BIT_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_CMD_END_BIT_ERR_OFF (2u)

/** \brief Length for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_CMD_IDX_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_CMD_IDX_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_CMD_IDX_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_CMD_IDX_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_CMD_IDX_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_CMD_IDX_ERR_OFF (3u)

/** \brief Length for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_DATA_TOUT_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_DATA_TOUT_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_DATA_TOUT_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_DATA_TOUT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_DATA_TOUT_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_DATA_TOUT_ERR_OFF (4u)

/** \brief Length for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_DATA_CRC_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_DATA_CRC_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_DATA_CRC_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_DATA_CRC_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_DATA_CRC_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_DATA_CRC_ERR_OFF (5u)

/** \brief Length for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_DATA_END_BIT_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_DATA_END_BIT_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_DATA_END_BIT_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_DATA_END_BIT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_DATA_END_BIT_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_DATA_END_BIT_ERR_OFF (6u)

/** \brief Length for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_CUR_LMT_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_CUR_LMT_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_CUR_LMT_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_CUR_LMT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_CUR_LMT_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_CUR_LMT_ERR_OFF (7u)

